#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_pet.secret_name: Refreshing state... [id=absolutely-helped-monkfish]
random_password.master: Refreshing state... [id=none]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_region.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.inference.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.inference.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-inference]
module.ingestion.aws_s3_bucket.ingestion_source_storage: Refreshing state... [id=levio-demo-fev-storage]
module.inference.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.ingestion.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-west-2]
module.ingestion.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.memory.data.aws_dynamodb_table.person_table: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.ingestion.aws_sqs_queue.dead_letter_queue: Refreshing state... [id=https://sqs.us-west-2.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue_dead_letter]
aws_secretsmanager_secret.password: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:446872271111:secret:vectordb-password-main-absolutely-helped-monkfish-hyaond]
module.inference.module.lambda_function_container_image.data.aws_region.current: Reading...
module.memory.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.memory.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-memory]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.memory.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.inference.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-west-2]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.memory.aws_dynamodb_table.basic-conversation_memory_table-table: Refreshing state... [id=levio-demo-fev-chat-history]
data.aws_availability_zones.available: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
aws_db_parameter_group.default: Refreshing state... [id=rds-pg]
module.ingestion.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
data.aws_ami.latest_amazon_linux: Reading...
module.ingestion.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-ingestion]
data.aws_availability_zones.available: Read complete after 1s [id=us-west-2]
module.inference.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0a28d56b4354e1555]
module.memory.module.lambda_function_container_image.data.aws_region.current: Reading...
module.memory.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-west-2]
module.memory.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=748480126]
module.ingestion.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-ingestion-role]
module.inference.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.memory.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-memory-role]
module.memory.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.inference.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-inference-role]
aws_secretsmanager_secret_version.password: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:446872271111:secret:vectordb-password-main-absolutely-helped-monkfish-hyaond|3682813B-FD26-444E-9A4A-059E260A3BB7]
data.aws_ami.latest_amazon_linux: Read complete after 1s [id=ami-05c89af705fc8fb3c]
data.aws_secretsmanager_secret.password: Reading...
module.ingestion.aws_sqs_queue.queue: Refreshing state... [id=https://sqs.us-west-2.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue]
module.memory.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-memory-role-inline]
module.memory.data.aws_dynamodb_table.person_table: Read complete after 1s [id=Person]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3103384725]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=4252567627]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1909623485]
module.memory.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-memory-role-logs]
module.inference.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-inference-role-logs]
module.ingestion.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-ingestion-role-logs]
module.memory.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-memory-role-20240117200858336800000002]
module.memory.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-memory-role-20240117200857754900000001]
module.ingestion.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-ingestion-role-20240111182508327600000001]
module.ingestion.aws_lambda_event_source_mapping.event_source_mapping: Refreshing state... [id=c9ba8237-858e-455f-9381-e5622914639c]
module.inference.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-inference-role-20240114021647614000000002]
data.aws_secretsmanager_secret.password: Read complete after 0s [id=arn:aws:secretsmanager:us-west-2:446872271111:secret:vectordb-password-main-absolutely-helped-monkfish-hyaond]
data.aws_secretsmanager_secret_version.password: Reading...
data.aws_secretsmanager_secret_version.password: Read complete after 0s [id=arn:aws:secretsmanager:us-west-2:446872271111:secret:vectordb-password-main-absolutely-helped-monkfish-hyaond|AWSCURRENT]
aws_security_group.lambda_memory_sg: Refreshing state... [id=sg-0bebfbf6b6ac10469]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-06f715bf935e801cd]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-034fb73568e35a2ad]
aws_security_group.lambda_inference_sg: Refreshing state... [id=sg-0be84384ec4db2a87]
aws_security_group.jumpbox_sg: Refreshing state... [id=sg-0c8d408915a011b41]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0634c8e7fd10a8009]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0bbf6497c54be8733]
aws_security_group.lambda_ingestion_sg: Refreshing state... [id=sg-056eb17c17ad555ff]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-02d7c67035e5124fa]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0cea1fda906409973]
module.vpc.aws_route_table.database[0]: Refreshing state... [id=rtb-0aa60a64fc5b1a696]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-027947bcf325829ac]
module.vpc.aws_route_table.database[1]: Refreshing state... [id=rtb-0021f9c618a3119d0]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0559b61f5a74fcac2]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-035759611c538ce80]
aws_security_group.dynamo_db_sg: Refreshing state... [id=sg-00aa64be66dbbf671]
module.ingestion.data.aws_iam_policy_document.sqs_policy: Reading...
module.ingestion.data.aws_iam_policy_document.sqs_policy: Read complete after 0s [id=1721867553]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-027947bcf325829ac1080289494]
aws_security_group.sm_sg: Refreshing state... [id=sg-0d150a18aaa621a04]
aws_security_group.bedrock_sg: Refreshing state... [id=sg-073098b78e8aa32b6]
aws_security_group.database_sg: Refreshing state... [id=sg-07425be98e514225f]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0bcce440882e2dc3f]
module.ingestion.aws_sqs_queue_policy.sqs_policy: Refreshing state... [id=https://sqs.us-west-2.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0fb53b1aed3271b31]
aws_instance.jumpbox: Refreshing state... [id=i-03a61c51dc0c480c7]
module.ingestion.aws_s3_bucket_notification.bucket_notification: Refreshing state... [id=levio-demo-fev-storage]
aws_vpc_endpoint.s3_endpoint: Refreshing state... [id=vpce-0a64fd872d6491e97]
aws_vpc_endpoint.dynamo_db_endpoint: Refreshing state... [id=vpce-0404d422e2525bc16]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=ex-terraform]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0b0356ee59303c51f]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-05a85d90c903644d5]
module.memory.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-memory]
aws_vpc_endpoint.secrets_manager_endpoint: Refreshing state... [id=vpce-022eb3a6d85fa06a7]
aws_vpc_endpoint.bedrock_endpoint: Refreshing state... [id=vpce-0327b452f427d62fc]
aws_db_instance.vector_db: Refreshing state... [id=db-YISND6N7BEMRMBM6WIYBKS3WJA]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1722092503]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=2773187410]
module.inference.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-inference-role-inline]
module.ingestion.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-ingestion-role-inline]
module.ingestion.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-ingestion-role-20240111183932540100000001]
module.inference.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-inference-role-20240114021647067300000001]
module.ingestion.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-ingestion]
module.inference.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-inference]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.inference.module.lambda_function_container_image.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-inference"
      ~ last_modified                  = "2024-01-18T00:39:50.246+0000" -> "2024-01-18T13:23:21.319+0000"
        tags                           = {}
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.memory.aws_dynamodb_table.basic-conversation_memory_table-table must be replaced
-/+ resource "aws_dynamodb_table" "basic-conversation_memory_table-table" {
      ~ arn                         = "arn:aws:dynamodb:us-west-2:446872271111:table/levio-demo-fev-chat-history" -> (known after apply)
      - deletion_protection_enabled = false -> null
      ~ hash_key                    = "CaseId" -> "SessionId" # forces replacement
      ~ id                          = "levio-demo-fev-chat-history" -> (known after apply)
        name                        = "levio-demo-fev-chat-history"
      ~ read_capacity               = 0 -> (known after apply)
      + stream_arn                  = (known after apply)
      - stream_enabled              = false -> null
      + stream_label                = (known after apply)
      + stream_view_type            = (known after apply)
      - table_class                 = "STANDARD" -> null
      - tags                        = {} -> null
      ~ write_capacity              = 0 -> (known after apply)
        # (3 unchanged attributes hidden)

      - attribute {
          - name = "CaseId" -> null
          - type = "S" -> null
        }
      + attribute {
          + name = "SessionId"
          + type = "S"
        }

      - point_in_time_recovery {
          - enabled = false -> null
        }

      - ttl {
          - enabled = false -> null
        }

        # (1 unchanged block hidden)
    }

  # module.inference.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-inference"
      ~ image_uri                      = "446872271111.dkr.ecr.us-west-2.amazonaws.com/inference-lambda-ecr:77224f7c3a8d33ab6846c4145b3777b4660d51ac968ac8f35530ffbb1a4ce0b7" -> "446872271111.dkr.ecr.us-west-2.amazonaws.com/inference-lambda-ecr:ddcd4dfd753795079413ae18d48988d055bde33cef7b66a8493e83098876532a"
      ~ last_modified                  = "2024-01-18T13:23:21.319+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DEV_MODE"                      = "1"
              + "MAX_TOKENS"                    = "100"
                # (6 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.memory.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-memory"
      ~ image_uri                      = "446872271111.dkr.ecr.us-west-2.amazonaws.com/memory-lambda-ecr:a7e247870165f855ce90d1ee14697e2c77ea3a9e03c5db06bdb6ee25fd121553" -> "446872271111.dkr.ecr.us-west-2.amazonaws.com/memory-lambda-ecr:74b1f6efb3cb5184b0248e469e2e86b5552f5d727ae86cf6174c87b61ce6681d"
      ~ last_modified                  = "2024-01-18T02:24:30.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @FloRul, Action: `pull_request`, Workflow: `Infrastructure planning and management`*